recipes/simmered-coconut-curried-tofu.org
#+TITLE: Simmered Coconut Curried Tofu
#+DATE: 2018-05-14
#+SETUPFILE: recipe.setup

* Ingredients
  - 1 block firm tofu
  - 1 tablespoon olive oil
  - 2 teaspoons sesame oil
  - 3 tablespoons peanut butter
  - 2 tablespoons soy sauce
  - 2 tablespoons water
  - 1 teaspoon curry powder
  - 1/4 cup coconut flakes
  - 2 tablespoons minced fresh cilantro

* Instructions
  1. Sure tofu in oil till brown
  2. Reduce heat to medium and add sesame oil, peanut butter, soy sauce, water and curry powder. Stir in and heat for 5 minutes
  3. Add coconut flakes and cilantro. Heat for 1 min

