recipes/simmered-coconut-curried-tofu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simmered Coconut Curried Tofu</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Simmered Coconut Curried Tofu</h1>

<div id="outline-container-org5b94f46" class="outline-2">
<h2 id="org5b94f46">Ingredients</h2>
<div class="outline-text-2" id="text-org5b94f46">
<ul class="org-ul">
<li>1 block firm tofu</li>
<li>1 tablespoon olive oil</li>
<li>2 teaspoons sesame oil</li>
<li>3 tablespoons peanut butter</li>
<li>2 tablespoons soy sauce</li>
<li>2 tablespoons water</li>
<li>1 teaspoon curry powder</li>
<li>1/4 cup coconut flakes</li>
<li>2 tablespoons minced fresh cilantro</li>
</ul>
</div>
</div>

<div id="outline-container-org9a7e740" class="outline-2">
<h2 id="org9a7e740">Method</h2>
<div class="outline-text-2" id="text-org9a7e740">
<ol class="org-ol">
<li>Sure tofu in oil till brown</li>
<li>Reduce heat to medium and add sesame oil, peanut butter, soy sauce, water and curry powder. Stir in and heat for 5 minutes</li>
<li>Add coconut flakes and cilantro. Heat for 1 min</li>
</ol>
</div>
</div>
</div>
</body>
</html>
